Terraform will perform the following actions:

  # cloudfoundry_app.onedealer-application will be updated in-place
  ~ resource "cloudfoundry_app" "example-application" {
      + buildpacks                  = (known after apply)
      ~ created_at                  = "2025-04-16T09:50:56Z" -> (known after apply)
      + disk_quota                  = (known after apply)
      ~ docker_credentials          = {
          + password = (sensitive value)
            # (1 unchanged attribute hidden)
        }
      + health_check_type           = (known after apply)
      ~ id                          = "f4e0c8ac-31c8-402f-b9f5-6debf1429144" -> (known after apply)
      + instances                   = (known after apply)
      + log_rate_limit_per_second   = (known after apply)
      + memory                      = (known after apply)
        name                        = "example-cf"
      + readiness_health_check_type = (known after apply)
      ~ routes                      = [
          - {
              - protocol = "http1" -> null
              - route    = "example" -> null
            },
        ] -> (known after apply)
      ~ stack                       = null -> (known after apply)
      ~ updated_at                  = "2025-04-16T09:53:10Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # cloudfoundry_route.onedealer-application will be updated in-place
  ~ resource "cloudfoundry_route" "example-application" {
      ~ destinations = [
          - {
              - app_id           = "f4e0c8ac-31c8-402f-b9f5-6debf1429144" -> null
              - app_process_type = "web" -> null
              - id               = "62d21abc-0bc1-4682-89e3-d61df7f7a51a" -> null
              - port             = 8080 -> null
              - protocol         = "http1" -> null
            },
          + {
              + app_id           = (known after apply)
              + app_process_type = "web"
              + id               = (known after apply)
              + port             = 8080
              + protocol         = "http1"
            },
        ]
        id           = "a66521e1-f0f9-4875-becc-618c45ea110d"
      ~ updated_at   = "2025-04-16T09:51:11Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }